![example](images/director_shot.jpeg)

# Project Title

**Authors:** Student 1, Student 2, Student 3
***

## Overview

A one-paragraph overview of the project, including the business problem, data, methods, results and recommendations.

## Business Problem

Summary of the business problem you are trying to solve, and the data questions that you plan to answer to solve them.

***
Questions to consider:
* What are the business's pain points related to this project?
* How did you pick the data analysis question(s) that you did?
* Why are these questions important from a business perspective?
***

## Data Understanding

Describe the data being used for this project.
***
Questions to consider:
* Where did the data come from, and how do they relate to the data analysis questions?
* What do the data represent? Who is in the sample and what variables are included?
* What is the target variable?
* What are the properties of the variables you intend to use?
***

In [12]:
# Import standard packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

### How does genre effect worldwide gross?

Does genre_id connect to genre in any other dataframe?

In [13]:
genre_id_df = pd.read_csv('data/zippedData/tmdb.movies.csv.gz')
genre_id_df

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

#### genre_id in the genre_id_df does not connect to genre in any  other dataframe that I have available, so I will not use it to correlate genre to worldwide gross.

In [14]:
# creating dataframes from csv's
genre_df = pd.read_csv('data/zippedData/imdb.title.basics.csv.gz')
title_df = pd.read_csv('data/zippedData/imdb.title.akas.csv.gz')
worldwide_gross_df = pd.read_csv('data/zippedData/tn.movie_budgets.csv.gz')

In [15]:
#exploring dataframes
genre_df

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [16]:
title_df

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,NaN,NaN,original,NaN,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,NaN,0.0
331700,tt9880178,1,La atención,NaN,NaN,original,NaN,1.0
331701,tt9880178,2,La atención,ES,NaN,NaN,NaN,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,NaN,0.0

#### Ensuring that title_df has corresponding movies in genre_df

In [17]:
print(genre_df.loc[genre_df['tconst'] == 'tt9880178'])

           tconst  primary_title original_title  start_year  runtime_minutes  \
145874  tt9880178  The Attention    La atención        2019             61.0

             genres
145874  Documentary

#### Exploring worldwide gross to figure out how to trim to top 100 movies

In [18]:
worldwide_gross_df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

#### Convert worldwide_gross to int

In [19]:
convert_worldwide_gross = worldwide_gross_df
convert_worldwide_gross['worldwide_gross'] = convert_worldwide_gross['worldwide_gross'].str.replace(',', '')
convert_worldwide_gross['worldwide_gross'] = convert_worldwide_gross['worldwide_gross'].str.replace('$', '')
convert_worldwide_gross['worldwide_gross'] = convert_worldwide_gross['worldwide_gross'].astype(int)
convert_worldwide_gross.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625",2776345279
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875",1045663875
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350",149762350
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868",1403013963
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382",1316721747

#### Trimming wordwide_gross_df to top 100 worldwide gross movies

In [20]:
top_100_gross = convert_worldwide_gross
top_100_gross = top_100_gross.nlargest(100,['worldwide_gross'])
top_100_gross

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625",2776345279
42,43,"Dec 19, 1997",Titanic,"$200,000,000","$659,363,944",2208208395
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225",2053311220
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482",2048134200
33,34,"Jun 12, 2015",Jurassic World,"$215,000,000","$652,270,625",1648854864
...,...,...,...,...,...,...
54,55,"May 23, 2014",X-Men: Days of Future Past,"$200,000,000","$233,921,534",747862775
196,97,"Jun 8, 2012",Madagascar 3: Europe's Most Wanted,"$145,000,000","$216,391,482",746921271
99,100,"Aug 5, 2016",Suicide Squad,"$175,000,000","$325,100,054",746059887
52,53,"Jun 21, 2013",Monsters University,"$200,000,000","$268,488,329",743588329
159,60,"May 15, 2003",The Matrix Reloaded,"$150,000,000","$281,553,689",738576929

#### Joining dataframes to ensure all necessary data is in the same dataframe

In [21]:
genre_df_join = genre_df
top_100_gross.join(genre_df_join.set_index(['primary_title'], verify_integrity=True), on='movie', how='left')
top_100_gross.head()

ValueError: Index has duplicate keys: Index(['Nemesis', 'Untitled Disney Marvel Film', 'Untitled Marvel Film',
       'Plushtubers: The Apocalypse', 'Indemnity', 'Cinderella', 'Windfall',
       'Prey', 'Olanda', 'Rok Sako To Rok Lo',
       ...
       'Occupied', 'Maaya', 'Goko Mako', 'The Pilgrim's Progress',
       'Simulation', 'Jessie', 'DK Bose', 'Bacchanalia', 'Drømmeland',
       'The Rehearsal'],
      dtype='object', name='primary_title', length=6182)

#### Clean up genre_df and maybe top_100_df by searching for duplicates.

In [22]:
genre_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

##### Considering the entries(146144) equals the Non-Null(146144) for primary_title, I know that I don't need to drop any movies that are listed without a title.

Now, I need to search for the duplicate values in primary_title.

##### Dropping duplicates in primary_title column of genre_df_join

In [23]:
genre_df_join = genre_df
genre_df_join = genre_df_join.drop_duplicates(subset=['primary_title'])
genre_df_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 136071 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           136071 non-null  object
 1   primary_title    136071 non-null  object
 2   original_title   136055 non-null  object
 3   start_year       136071 non-null  int64
 4   runtime_minutes  106598 non-null  float64
 5   genres           131180 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 7.3+ MB

#### Left join without the duplicates.

In [24]:
top_100_gross_join = top_100_gross.join(genre_df_join.set_index(['primary_title'], verify_integrity=True), on='movie', how='left')
top_100_gross_join.tail(20)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,original_title,start_year,runtime_minutes,genres
49,50,"Jun 30, 2004",Spider-Man 2,"$200,000,000","$373,524,485",795110670,NaN,NaN,NaN,NaN,NaN
3525,26,"Jun 11, 1982",ET: The Extra-Terrestrial,"$10,500,000","$435,110,554",792965326,NaN,NaN,NaN,NaN,NaN
139,40,"May 24, 2013",Fast and Furious 6,"$160,000,000","$238,679,850",789300444,NaN,NaN,NaN,NaN,NaN
24,25,"May 26, 2017",Pirates of the Caribbean: Dead Men Tell No Tales,"$230,000,000","$172,558,876",788241137,tt1790809,Pirates of the Caribbean: Dead Men Tell No Tales,2017.0,129.0,"Action,Adventure,Fantasy"
91,92,"Jul 27, 2018",Mission: ImpossibleâFallout,"$178,000,000","$220,159,104",787456552,NaN,NaN,NaN,NaN,NaN
314,15,"May 18, 2018",Deadpool 2,"$110,000,000","$324,591,735",786680557,tt5463162,Deadpool 2,2018.0,119.0,"Action,Adventure,Comedy"
75,76,"May 22, 2008",Indiana Jones and the Kingdom of the Crystal S...,"$185,000,000","$317,101,119",786635413,NaN,NaN,NaN,NaN,NaN
3464,65,"May 25, 1977",Star Wars Ep. IV: A New Hope,"$11,000,000","$460,998,007",786598007,NaN,NaN,NaN,NaN,NaN
113,14,"Aug 1, 2014",Guardians of the Galaxy,"$170,000,000","$333,172,112",770867516,tt2015381,Guardians of the Galaxy,2014.0,121.0,"Action,Adventure,Comedy"
264,65,"May 19, 2006",The Da Vinci Code,"$125,000,000","$217,536,138",767820459,NaN,NaN,NaN,NaN,NaN
261,62,"Nov 21, 2014",The Hunger Games: Mockingjay - Part 1,"$125,000,000","$337,135,885",766575131,tt1951265,The Hunger Games: Mockingjay - Part 1,2014.0,123.0,"Action,Adventure,Sci-Fi"
83,84,"May 30, 2014",Maleficent,"$180,000,000","$241,407,328",758536735,tt1587310,Maleficent,2014.0,97.0,"Action,Adventure,Family"
30,31,"Jul 3, 2012",The Amazing Spider-Man,"$220,000,000","$262,030,663",757890267,tt0948470,The Amazing Spider-Man,2012.0,136.0,"Action,Adventure,Sci-Fi"
58,59,"Nov 13, 2009",2012,"$200,000,000","$166,112,167",757677748,NaN,NaN,NaN,NaN,NaN
126,27,"May 21, 2010",Shrek Forever After,"$165,000,000","$238,736,787",756244673,tt0892791,Shrek Forever After,2010.0,93.0,"Adventure,Animation,Comedy"
54,55,"May 23, 2014",X-Men: Days of Future Past,"$200,000,000","$233,921,534",747862775,tt1877832,X-Men: Days of Future Past,2014.0,132.0,"Action,Adventure,Sci-Fi"
196,97,"Jun 8, 2012",Madagascar 3: Europe's Most Wanted,"$145,000,000","$216,391,482",746921271,tt1277953,Madagascar 3: Europe's Most Wanted,2012.0,93.0,"Adventure,Animation,Comedy"
99,100,"Aug 5, 2016",Suicide Squad,"$175,000,000","$325,100,054",746059887,tt1386697,Suicide Squad,2016.0,123.0,"Action,Adventure,Fantasy"
52,53,"Jun 21, 2013",Monsters University,"$200,000,000","$268,488,329",743588329,tt1453405,Monsters University,2013.0,104.0,"Adventure,Animation,Comedy"
159,60,"May 15, 2003",The Matrix Reloaded,"$150,000,000","$281,553,689",738576929,NaN,NaN,NaN,NaN,NaN

#### Great! Now, were all 100 movies joined?

In [25]:
top_100_gross_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 159
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 100 non-null    int64
 1   release_date       100 non-null    object
 2   movie              100 non-null    object
 3   production_budget  100 non-null    object
 4   domestic_gross     100 non-null    object
 5   worldwide_gross    100 non-null    int64
 6   tconst             62 non-null     object
 7   original_title     62 non-null     object
 8   start_year         62 non-null     float64
 9   runtime_minutes    59 non-null     float64
 10  genres             61 non-null     object
dtypes: float64(2), int64(2), object(7)
memory usage: 9.4+ KB

#### Yes, they were, however only 61 of the movies have genre data. Should I figure out how to pull the top 100 movies with genre data, or add genre data to 39 movies?

In [26]:
print(top_100_gross_join.loc[top_100_gross_join['genres'] == 'NaN'])

Empty DataFrame
Columns: [id, release_date, movie, production_budget, domestic_gross, worldwide_gross, tconst, original_title, start_year, runtime_minutes, genres]
Index: []

In [27]:
top_100_gross_join['genres'].isnull().values.sum()

39

In [28]:
missing_genre = pd.isnull(top_100_gross_join['genres'])
top_100_gross_join[missing_genre]

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,original_title,start_year,runtime_minutes,genres
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225",2053311220,NaN,NaN,NaN,NaN,NaN
260,61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,"$125,000,000","$381,193,157",1341693157,NaN,NaN,NaN,NaN,NaN
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382",1316721747,NaN,NaN,NaN,NaN,NaN
425,26,"Dec 17, 2003",The Lord of the Rings: The Return of the King,"$94,000,000","$377,845,905",1141403341,NaN,NaN,NaN,NaN,NaN
27,28,"Jul 7, 2006",Pirates of the Caribbean: Dead Manâs Chest,"$225,000,000","$423,315,812",1066215812,NaN,NaN,NaN,NaN,NaN
824,25,"Jun 11, 1993",Jurassic Park,"$63,000,000","$395,708,305",1038812584,NaN,NaN,NaN,NaN,NaN
303,4,"May 19, 1999",Star Wars Ep. I: The Phantom Menace,"$115,000,000","$474,544,677",1027044677,NaN,NaN,NaN,NaN,NaN
74,75,"Jul 18, 2008",The Dark Knight,"$185,000,000","$533,720,947",1001996207,NaN,NaN,NaN,NaN,NaN
262,63,"Nov 16, 2001",Harry Potter and the Sorcererâs Stone,"$125,000,000","$317,871,467",975047606,NaN,NaN,NaN,NaN,NaN
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425",963420425,NaN,NaN,NaN,NaN,NaN
263,64,"Nov 19, 2010",Harry Potter and the Deathly Hallows: Part I,"$125,000,000","$296,131,568",960431568,NaN,NaN,NaN,NaN,NaN
157,58,"Jul 11, 2007",Harry Potter and the Order of the Phoenix,"$150,000,000","$292,137,260",943076457,NaN,NaN,NaN,NaN,NaN
692,93,"May 19, 2004",Shrek 2,"$70,000,000","$441,226,247",937008132,NaN,NaN,NaN,NaN,NaN
424,25,"May 30, 2003",Finding Nemo,"$94,000,000","$380,529,370",936429370,NaN,NaN,NaN,NaN,NaN
19,20,"Jul 15, 2009",Harry Potter and the Half-Blood Prince,"$250,000,000","$302,089,278",935213767,NaN,NaN,NaN,NaN,NaN
426,27,"Dec 18, 2002",The Lord of the Rings: The Two Towers,"$94,000,000","$342,548,984",934699645,NaN,NaN,NaN,NaN,NaN
158,59,"Nov 18, 2005",Harry Potter and the Goblet of Fire,"$150,000,000","$290,201,752",897099794,NaN,NaN,NaN,NaN,NaN
15,16,"May 4, 2007",Spider-Man 3,"$258,000,000","$336,530,303",894860230,NaN,NaN,NaN,NaN,NaN
342,43,"Dec 19, 2001",The Lord of the Rings: The Fellowship of the Ring,"$109,000,000","$315,544,750",887210985,NaN,NaN,NaN,NaN,NaN
363,64,"Nov 15, 2002",Harry Potter and the Chamber of Secrets,"$100,000,000","$262,233,381",879225135,NaN,NaN,NaN,NaN,NaN
48,49,"May 5, 2017",Guardians of the Galaxy Vol 2,"$200,000,000","$389,813,101",862316233,NaN,NaN,NaN,NaN,NaN
442,43,"Jul 1, 2009",Ice Age: Dawn of the Dinosaurs,"$90,000,000","$196,573,705",859701857,NaN,NaN,NaN,NaN,NaN
304,5,"May 19, 2005",Star Wars Ep. III: Revenge of the Sith,"$115,000,000","$380,270,577",848998877,NaN,NaN,NaN,NaN,NaN
35,36,"Jun 24, 2009",Transformers: Revenge of the Fallen,"$210,000,000","$402,111,870",836519699,NaN,NaN,NaN,NaN,NaN
224,25,"Nov 16, 2012","The Twilight Saga: Breaking Dawn, Part 2","$136,200,000","$292,324,737",829724737,NaN,NaN,NaN,NaN,NaN
218,19,"May 3, 2002",Spider-Man,"$139,000,000","$403,706,375",821706375,NaN,NaN,NaN,NaN,NaN
626,27,"Jul 2, 1996",Independence Day,"$75,000,000","$306,169,255",817400878,NaN,NaN,NaN,NaN,NaN
136,37,"May 17, 2007",Shrek the Third,"$160,000,000","$322,719,944",807330936,NaN,NaN,NaN,NaN,NaN
101,2,"Nov 22, 2017",Coco,"$175,000,000","$209,726,015",798008101,tt10453328,Coco,2018.0,NaN,NaN
238,39,"Jun 4, 2004",Harry Potter and the Prisoner of Azkaban,"$130,000,000","$249,757,726",796907323,NaN,NaN,NaN,NaN,NaN
49,50,"Jun 30, 2004",Spider-Man 2,"$200,000,000","$373,524,485",795110670,NaN,NaN,NaN,NaN,NaN
3525,26,"Jun 11, 1982",ET: The Extra-Terrestrial,"$10,500,000","$435,110,554",792965326,NaN,NaN,NaN,NaN,NaN
139,40,"May 24, 2013",Fast and Furious 6,"$160,000,000","$238,679,850",789300444,NaN,NaN,NaN,NaN,NaN
91,92,"Jul 27, 2018",Mission: ImpossibleâFallout,"$178,000,000","$220,159,104",787456552,NaN,NaN,NaN,NaN,NaN
75,76,"May 22, 2008",Indiana Jones and the Kingdom of the Crystal S...,"$185,000,000","$317,101,119",786635413,NaN,NaN,NaN,NaN,NaN
3464,65,"May 25, 1977",Star Wars Ep. IV: A New Hope,"$11,000,000","$460,998,007",786598007,NaN,NaN,NaN,NaN,NaN
264,65,"May 19, 2006",The Da Vinci Code,"$125,000,000","$217,536,138",767820459,NaN,NaN,NaN,NaN,NaN
58,59,"Nov 13, 2009",2012,"$200,000,000","$166,112,167",757677748,NaN,NaN,NaN,NaN,NaN
159,60,"May 15, 2003",The Matrix Reloaded,"$150,000,000","$281,553,689",738576929,NaN,NaN,NaN,NaN,NaN

In [29]:
print(genre_df.loc[genre_df['primary_title'] == 'Coco'])

            tconst primary_title original_title  start_year  runtime_minutes  \
5231    tt10453328          Coco           Coco        2018              NaN
38424    tt2380307          Coco           Coco        2017            105.0
117464   tt7002100          Coco           Coco        2017             98.0

                            genres
5231                           NaN
38424   Adventure,Animation,Comedy
117464                      Horror

#### Now, I see that there are many movies with the same name in the genre_df and this is causing issues.  
* Clearly, Coco should be returning as the tconst tt2380307, rather than the tt10453328.   
* So, I am going to try joining the title_df to the top_100_join as titles_df_join before joining that dataframe with genre_df_join.

In [30]:
title_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 331703 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           331703 non-null  object
 1   ordering           331703 non-null  int64
 2   title              331703 non-null  object
 3   region             278410 non-null  object
 4   language           41715 non-null   object
 5   types              168447 non-null  object
 6   attributes         14925 non-null   object
 7   is_original_title  331678 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 20.2+ MB

In [31]:
title_df_join = title_df
title_df_join = title_df.drop_duplicates(subset=['title'])
title_df_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 252781 entries, 0 to 331702
Data columns (total 8 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   title_id           252781 non-null  object
 1   ordering           252781 non-null  int64
 2   title              252781 non-null  object
 3   region             221956 non-null  object
 4   language           32890 non-null   object
 5   types              120946 non-null  object
 6   attributes         12527 non-null   object
 7   is_original_title  252763 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 17.4+ MB

In [32]:
title_df_join = top_100_gross.join(title_df_join.set_index(['title'], verify_integrity=True), on='movie', how='left')
title_df_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 0 to 159
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 100 non-null    int64
 1   release_date       100 non-null    object
 2   movie              100 non-null    object
 3   production_budget  100 non-null    object
 4   domestic_gross     100 non-null    object
 5   worldwide_gross    100 non-null    int64
 6   title_id           62 non-null     object
 7   ordering           62 non-null     float64
 8   region             46 non-null     object
 9   language           9 non-null      object
 10  types              44 non-null     object
 11  attributes         2 non-null      object
 12  is_original_title  62 non-null     float64
dtypes: float64(2), int64(2), object(9)
memory usage: 10.9+ KB

#### Sadly, the title_id column (62 non-null) will not net us much more reliable data than using the titles to join between top_100_df (61 non-null) and genre_df. 

* So, I think I will clean up the top_100_join dataframe by manually checking and changing the relevant movies.

* In order to cut down on some of the work, I will cut it down to the top 50 grossing movies.

#### trimming wordwide_gross_df to top 50 worldwide gross movies

In [33]:
top_50_gross = convert_worldwide_gross
top_50_gross = top_100_gross.nlargest(50,['worldwide_gross'])
top_50_gross.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625",2776345279
42,43,"Dec 19, 1997",Titanic,"$200,000,000","$659,363,944",2208208395
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225",2053311220
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482",2048134200
33,34,"Jun 12, 2015",Jurassic World,"$215,000,000","$652,270,625",1648854864

#### Join top_50_gross to genre_df_join

In [34]:
top_50_gross_join = top_50_gross.join(genre_df_join.set_index(['primary_title'], verify_integrity=True), on='movie', how='left')
top_50_gross_join

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,original_title,start_year,runtime_minutes,genres
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625",2776345279,tt1775309,Abatâ,2011.0,93.0,Horror
42,43,"Dec 19, 1997",Titanic,"$200,000,000","$659,363,944",2208208395,tt2495766,Titanic,2012.0,NaN,Adventure
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225",2053311220,NaN,NaN,NaN,NaN,NaN
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482",2048134200,tt4154756,Avengers: Infinity War,2018.0,149.0,"Action,Adventure,Sci-Fi"
33,34,"Jun 12, 2015",Jurassic World,"$215,000,000","$652,270,625",1648854864,tt0369610,Jurassic World,2015.0,124.0,"Action,Adventure,Sci-Fi"
66,67,"Apr 3, 2015",Furious 7,"$190,000,000","$353,007,020",1518722794,tt2820852,Furious Seven,2015.0,137.0,"Action,Crime,Thriller"
26,27,"May 4, 2012",The Avengers,"$225,000,000","$623,279,547",1517935897,tt0848228,The Avengers,2012.0,143.0,"Action,Adventure,Sci-Fi"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868",1403013963,tt2395427,Avengers: Age of Ultron,2015.0,141.0,"Action,Adventure,Sci-Fi"
41,42,"Feb 16, 2018",Black Panther,"$200,000,000","$700,059,566",1348258224,tt1825683,Black Panther,2018.0,134.0,"Action,Adventure,Sci-Fi"
260,61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,"$125,000,000","$381,193,157",1341693157,NaN,NaN,NaN,NaN,NaN
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382",1316721747,NaN,NaN,NaN,NaN,NaN
112,13,"Jun 22, 2018",Jurassic World: Fallen Kingdom,"$170,000,000","$417,719,760",1305772799,tt4881806,Jurassic World: Fallen Kingdom,2018.0,128.0,"Action,Adventure,Sci-Fi"
155,56,"Nov 22, 2013",Frozen,"$150,000,000","$400,738,009",1272469910,tt1323045,Frozen,2010.0,93.0,"Adventure,Drama,Sport"
134,35,"Mar 17, 2017",Beauty and the Beast,"$160,000,000","$504,014,165",1259199706,tt2316801,La belle et la bête,2014.0,112.0,"Drama,Fantasy,Romance"
43,44,"Jun 15, 2018",Incredibles 2,"$200,000,000","$608,581,744",1242520711,tt3606756,Incredibles 2,2018.0,118.0,"Action,Adventure,Animation"
22,23,"Apr 14, 2017",The Fate of the Furious,"$250,000,000","$225,764,765",1234846267,tt4630562,The Fate of the Furious,2017.0,136.0,"Action,Crime,Thriller"
47,48,"May 3, 2013",Iron Man 3,"$200,000,000","$408,992,272",1215392272,tt1300854,Iron Man Three,2013.0,130.0,"Action,Adventure,Sci-Fi"
672,73,"Jul 10, 2015",Minions,"$74,000,000","$336,045,770",1160336173,tt2293640,Minions,2015.0,91.0,"Adventure,Animation,Comedy"
135,36,"Dec 21, 2018",Aquaman,"$160,000,000","$335,061,807",1146894640,tt1477834,Aquaman,2018.0,143.0,"Action,Adventure,Fantasy"
425,26,"Dec 17, 2003",The Lord of the Rings: The Return of the King,"$94,000,000","$377,845,905",1141403341,NaN,NaN,NaN,NaN,NaN
16,17,"May 6, 2016",Captain America: Civil War,"$250,000,000","$408,084,349",1140069413,tt3498820,Captain America: Civil War,2016.0,147.0,"Action,Adventure,Sci-Fi"
63,64,"Jun 29, 2011",Transformers: Dark of the Moon,"$195,000,000","$352,390,543",1123790543,tt1399103,Transformers: Dark of the Moon,2011.0,154.0,"Action,Adventure,Sci-Fi"
95,96,"Mar 8, 2019",Captain Marvel,"$175,000,000","$426,525,952",1123061550,tt4154664,Captain Marvel,2019.0,123.0,"Action,Adventure,Sci-Fi"
51,52,"Nov 8, 2012",Skyfall,"$200,000,000","$304,360,277",1110526981,tt1074638,Skyfall,2012.0,143.0,"Action,Adventure,Thriller"
36,37,"Jun 27, 2014",Transformers: Age of Extinction,"$210,000,000","$245,439,076",1104039076,tt2109248,Transformers: Age of Extinction,2014.0,165.0,"Action,Adventure,Sci-Fi"
10,11,"Jul 20, 2012",The Dark Knight Rises,"$275,000,000","$448,139,099",1084439099,tt1345836,The Dark Knight Rises,2012.0,164.0,"Action,Thriller"
46,47,"Jun 18, 2010",Toy Story 3,"$200,000,000","$415,004,880",1068879522,tt0435761,Toy Story 3,2010.0,103.0,"Adventure,Animation,Comedy"
27,28,"Jul 7, 2006",Pirates of the Caribbean: Dead Manâs Chest,"$225,000,000","$423,315,812",1066215812,NaN,NaN,NaN,NaN,NaN
44,45,"Dec 16, 2016",Rogue One: A Star Wars Story,"$200,000,000","$532,177,324",1049102856,tt3748528,Rogue One,2016.0,133.0,"Action,Adventure,Sci-Fi"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875",1045663875,tt1298650,Pirates of the Caribbean: On Stranger Tides,2011.0,136.0,"Action,Adventure,Fantasy"
824,25,"Jun 11, 1993",Jurassic Park,"$63,000,000","$395,708,305",1038812584,NaN,NaN,NaN,NaN,NaN
629,30,"Jun 30, 2017",Despicable Me 3,"$75,000,000","$264,624,300",1034727750,tt3469046,Despicable Me 3,2017.0,89.0,"Adventure,Animation,Comedy"
303,4,"May 19, 1999",Star Wars Ep. I: The Phantom Menace,"$115,000,000","$474,544,677",1027044677,NaN,NaN,NaN,NaN,NaN
50,51,"Mar 5, 2010",Alice in Wonderland,"$200,000,000","$334,191,110",1025491110,tt1014759,Alice in Wonderland,2010.0,108.0,"Adventure,Family,Fantasy"
45,46,"Jun 17, 2016",Finding Dory,"$200,000,000","$486,295,561",1021215193,tt2277860,Finding Dory,2016.0,97.0,"Adventure,Animation,Comedy"
156,57,"Mar 4, 2016",Zootopia,"$150,000,000","$341,268,248",1019429616,tt2948356,Zootopia,2016.0,108.0,"Adventure,Animation,Comedy"
18,19,"Dec 14, 2012",The Hobbit: An Unexpected Journey,"$250,000,000","$303,003,568",1017003568,tt0903624,The Hobbit: An Unexpected Journey,2012.0,169.0,"Adventure,Family,Fantasy"
74,75,"Jul 18, 2008",The Dark Knight,"$185,000,000","$533,720,947",1001996207,NaN,NaN,NaN,NaN,NaN
608,9,"Jun 15, 1994",The Lion King,"$79,300,000","$421,785,283",986214868,tt6105098,The Lion King,2019.0,NaN,"Adventure,Animation,Drama"
621,22,"Jul 3, 2013",Despicable Me 2,"$76,000,000","$368,065,385",975216835,tt1690953,Despicable Me 2,2013.0,98.0,"Adventure,Animation,Comedy"
262,63,"Nov 16, 2001",Harry Potter and the Sorcererâs Stone,"$125,000,000","$317,871,467",975047606,NaN,NaN,NaN,NaN,NaN
437,38,"Dec 20, 2017",Jumanji: Welcome to the Jungle,"$90,000,000","$404,508,916",964496193,tt2283362,Jumanji: Welcome to the Jungle,2017.0,119.0,"Action,Adventure,Comedy"
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425",963420425,NaN,NaN,NaN,NaN,NaN
96,97,"Apr 15, 2016",The Jungle Book,"$175,000,000","$364,001,123",962854547,tt2226178,The Jungle Book,2014.0,64.0,Animation
263,64,"Nov 19, 2010",Harry Potter and the Deathly Hallows: Part I,"$125,000,000","$296,131,568",960431568,NaN,NaN,NaN,NaN,NaN
20,21,"Dec 13, 2013",The Hobbit: The Desolation of Smaug,"$250,000,000","$258,366,855",960366855,tt1170358,The Hobbit: The Desolation of Smaug,2013.0,161.0,"Adventure,Fantasy"
21,22,"Dec 17, 2014",The Hobbit: The Battle of the Five Armies,"$250,000,000","$255,119,788",945577621,tt2310332,The Hobbit: The Battle of the Five Armies,2014.0,144.0,"Adventure,Fantasy"
157,58,"Jul 11, 2007",Harry Potter and the Order of the Phoenix,"$150,000,000","$292,137,260",943076457,NaN,NaN,NaN,NaN,NaN
692,93,"May 19, 2004",Shrek 2,"$70,000,000","$441,226,247",937008132,NaN,NaN,NaN,NaN,NaN
424,25,"May 30, 2003",Finding Nemo,"$94,000,000","$380,529,370",936429370,NaN,NaN,NaN,NaN,NaN

#### Find and replace NaN and incorrect genres

In [35]:
missing_genre_50 = pd.isnull(top_50_gross_join['genres'])
missing_genre = top_50_gross_join[missing_genre_50]
missing_genre

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,original_title,start_year,runtime_minutes,genres
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225",2053311220,NaN,NaN,NaN,NaN,NaN
260,61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,"$125,000,000","$381,193,157",1341693157,NaN,NaN,NaN,NaN,NaN
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382",1316721747,NaN,NaN,NaN,NaN,NaN
425,26,"Dec 17, 2003",The Lord of the Rings: The Return of the King,"$94,000,000","$377,845,905",1141403341,NaN,NaN,NaN,NaN,NaN
27,28,"Jul 7, 2006",Pirates of the Caribbean: Dead Manâs Chest,"$225,000,000","$423,315,812",1066215812,NaN,NaN,NaN,NaN,NaN
824,25,"Jun 11, 1993",Jurassic Park,"$63,000,000","$395,708,305",1038812584,NaN,NaN,NaN,NaN,NaN
303,4,"May 19, 1999",Star Wars Ep. I: The Phantom Menace,"$115,000,000","$474,544,677",1027044677,NaN,NaN,NaN,NaN,NaN
74,75,"Jul 18, 2008",The Dark Knight,"$185,000,000","$533,720,947",1001996207,NaN,NaN,NaN,NaN,NaN
262,63,"Nov 16, 2001",Harry Potter and the Sorcererâs Stone,"$125,000,000","$317,871,467",975047606,NaN,NaN,NaN,NaN,NaN
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425",963420425,NaN,NaN,NaN,NaN,NaN
263,64,"Nov 19, 2010",Harry Potter and the Deathly Hallows: Part I,"$125,000,000","$296,131,568",960431568,NaN,NaN,NaN,NaN,NaN
157,58,"Jul 11, 2007",Harry Potter and the Order of the Phoenix,"$150,000,000","$292,137,260",943076457,NaN,NaN,NaN,NaN,NaN
692,93,"May 19, 2004",Shrek 2,"$70,000,000","$441,226,247",937008132,NaN,NaN,NaN,NaN,NaN
424,25,"May 30, 2003",Finding Nemo,"$94,000,000","$380,529,370",936429370,NaN,NaN,NaN,NaN,NaN

In [36]:
missing_genre.at[5,'genres'] == "Action,Adventure,Sci-Fi"
missing_genre

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,original_title,start_year,runtime_minutes,genres
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225",2053311220,NaN,NaN,NaN,NaN,NaN
260,61,"Jul 15, 2011",Harry Potter and the Deathly Hallows: Part II,"$125,000,000","$381,193,157",1341693157,NaN,NaN,NaN,NaN,NaN
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382",1316721747,NaN,NaN,NaN,NaN,NaN
425,26,"Dec 17, 2003",The Lord of the Rings: The Return of the King,"$94,000,000","$377,845,905",1141403341,NaN,NaN,NaN,NaN,NaN
27,28,"Jul 7, 2006",Pirates of the Caribbean: Dead Manâs Chest,"$225,000,000","$423,315,812",1066215812,NaN,NaN,NaN,NaN,NaN
824,25,"Jun 11, 1993",Jurassic Park,"$63,000,000","$395,708,305",1038812584,NaN,NaN,NaN,NaN,NaN
303,4,"May 19, 1999",Star Wars Ep. I: The Phantom Menace,"$115,000,000","$474,544,677",1027044677,NaN,NaN,NaN,NaN,NaN
74,75,"Jul 18, 2008",The Dark Knight,"$185,000,000","$533,720,947",1001996207,NaN,NaN,NaN,NaN,NaN
262,63,"Nov 16, 2001",Harry Potter and the Sorcererâs Stone,"$125,000,000","$317,871,467",975047606,NaN,NaN,NaN,NaN,NaN
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425",963420425,NaN,NaN,NaN,NaN,NaN
263,64,"Nov 19, 2010",Harry Potter and the Deathly Hallows: Part I,"$125,000,000","$296,131,568",960431568,NaN,NaN,NaN,NaN,NaN
157,58,"Jul 11, 2007",Harry Potter and the Order of the Phoenix,"$150,000,000","$292,137,260",943076457,NaN,NaN,NaN,NaN,NaN
692,93,"May 19, 2004",Shrek 2,"$70,000,000","$441,226,247",937008132,NaN,NaN,NaN,NaN,NaN
424,25,"May 30, 2003",Finding Nemo,"$94,000,000","$380,529,370",936429370,NaN,NaN,NaN,NaN,NaN

##### 14 movie genres to add - I can do this.

In [37]:
missing_genre_replaced = missing_genre["genres"].replace"Action,Adventure,Sci-Fi", "Adventure,Fantasy,Mystery"]})
missing_genre_replaced

SyntaxError: invalid syntax (<ipython-input-37-50a985190479>, line 1)

In [ ]:
replace_val_top_50 = top_50_gross_join
replace_val_top_50.replace(to_replace=)

I am pausing and coming back to this - now I am going to start making the histogram.

#### Making the Histogram of Genre's for Top 50 Grossing Movies

In [ ]:
genre_columns = top_50_gross_join
values = True if 'Adventure' in genre_columns['genres']
        Else:
            return False
genre_columns['Adventure'] = values
genre_columns

In [38]:
top_50_gross_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 50 entries, 0 to 424
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 50 non-null     int64
 1   release_date       50 non-null     object
 2   movie              50 non-null     object
 3   production_budget  50 non-null     object
 4   domestic_gross     50 non-null     object
 5   worldwide_gross    50 non-null     int64
 6   tconst             36 non-null     object
 7   original_title     36 non-null     object
 8   start_year         36 non-null     float64
 9   runtime_minutes    34 non-null     float64
 10  genres             36 non-null     object
dtypes: float64(2), int64(2), object(7)
memory usage: 4.7+ KB

In [ ]:
fig, ax = plt.hist(top_50_gross_join['genres'])
labels = ax.get_xticklabels()
plt.setp(labels, rotation=45, horizontalalignment='right')

## Data Preparation

Describe and justify the process for preparing the data for analysis.

***
Questions to consider:
* Were there variables you dropped or created?
* How did you address missing values or outliers?
* Why are these choices appropriate given the data and the business problem?
***

In [ ]:
# Here you run your code to clean the data

## Data Modeling
Describe and justify the process for analyzing or modeling the data.

***
Questions to consider:
* How did you analyze or model the data?
* How did you iterate on your initial approach to make it better?
* Why are these choices appropriate given the data and the business problem?
***

In [ ]:
# Here you run your code to model the data

## Evaluation
Evaluate how well your work solves the stated business problem.

***
Questions to consider:
* How do you interpret the results?
* How well does your model fit your data? How much better is this than your baseline model?
* How confident are you that your results would generalize beyond the data you have?
* How confident are you that this model would benefit the business if put into use?
***

## Conclusions
Provide your conclusions about the work you've done, including any limitations or next steps.

***
Questions to consider:
* What would you recommend the business do as a result of this work?
* What are some reasons why your analysis might not fully solve the business problem?
* What else could you do in the future to improve this project?
***

In [ ]:
![example](images/director_shot.jpeg)

# Project Title

**Authors:** Student 1, Student 2, Student 3
***

## Overview

A one-paragraph overview of the project, including the business problem, data, methods, results and recommendations.

## Business Problem

Summary of the business problem you are trying to solve, and the data questions that you plan to answer to solve them.

***
Questions to consider:
* What are the business's pain points related to this project?
* How did you pick the data analysis question(s) that you did?
* Why are these questions important from a business perspective?
***

## Data Understanding

Describe the data being used for this project.
***
Questions to consider:
* Where did the data come from, and how do they relate to the data analysis questions?
* What do the data represent? Who is in the sample and what variables are included?
* What is the target variable?
* What are the properties of the variables you intend to use?
***

# Import standard packages
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

### How does genre effect worldwide gross?

Does genre_id connect to genre in any other dataframe?

genre_id_df = pd.read_csv('data/zippedData/tmdb.movies.csv.gz')
genre_id_df

#### genre_id in the genre_id_df does not connect to genre in any  other dataframe that I have available, so I will not use it to correlate genre to worldwide gross.

# creating dataframes from csv's
genre_df = pd.read_csv('data/zippedData/imdb.title.basics.csv.gz')
title_df = pd.read_csv('data/zippedData/imdb.title.akas.csv.gz')
worldwide_gross_df = pd.read_csv('data/zippedData/tn.movie_budgets.csv.gz')

#exploring dataframes
genre_df

title_df

#### Ensuring that title_df has corresponding movies in genre_df

print(genre_df.loc[genre_df['tconst'] == 'tt9880178'])

#### Exploring worldwide gross to figure out how to trim to top 100 movies

worldwide_gross_df

#### Convert worldwide_gross to int

convert_worldwide_gross = worldwide_gross_df
convert_worldwide_gross['worldwide_gross'] = convert_worldwide_gross['worldwide_gross'].str.replace(',', '')
convert_worldwide_gross['worldwide_gross'] = convert_worldwide_gross['worldwide_gross'].str.replace('$', '')
convert_worldwide_gross['worldwide_gross'] = convert_worldwide_gross['worldwide_gross'].astype(int)
convert_worldwide_gross.head()

#### Trimming wordwide_gross_df to top 100 worldwide gross movies

top_100_gross = convert_worldwide_gross
top_100_gross = top_100_gross.nlargest(100,['worldwide_gross'])
top_100_gross

#### Joining dataframes to ensure all necessary data is in the same dataframe

genre_df_join = genre_df
top_100_gross.join(genre_df_join.set_index(['primary_title'], verify_integrity=True), on='movie', how='left')
top_100_gross.head()

#### Clean up genre_df and maybe top_100_df by searching for duplicates.

genre_df.info()

##### Considering the entries(146144) equals the Non-Null(146144) for primary_title, I know that I don't need to drop any movies that are listed without a title.

Now, I need to search for the duplicate values in primary_title.

##### Dropping duplicates in primary_title column of genre_df_join

genre_df_join = genre_df
genre_df_join = genre_df_join.drop_duplicates(subset=['primary_title'])
genre_df_join.info()

#### Left join without the duplicates.

top_100_gross_join = top_100_gross.join(genre_df_join.set_index(['primary_title'], verify_integrity=True), on='movie', how='left')
top_100_gross_join.tail(20)

#### Great! Now, were all 100 movies joined?

top_100_gross_join.info()

#### Yes, they were, however only 61 of the movies have genre data. Should I figure out how to pull the top 100 movies with genre data, or add genre data to 39 movies?

print(top_100_gross_join.loc[top_100_gross_join['genres'] == 'NaN'])

top_100_gross_join['genres'].isnull().values.sum()

missing_genre = pd.isnull(top_100_gross_join['genres'])
top_100_gross_join[missing_genre]

print(genre_df.loc[genre_df['primary_title'] == 'Coco'])

#### Now, I see that there are many movies with the same name in the genre_df and this is causing issues.  
* Clearly, Coco should be returning as the tconst tt2380307, rather than the tt10453328.   
* So, I am going to try joining the title_df to the top_100_join as titles_df_join before joining that dataframe with genre_df_join.

title_df.info()

title_df_join = title_df
title_df_join = title_df.drop_duplicates(subset=['title'])
title_df_join.info()

title_df_join = top_100_gross.join(title_df_join.set_index(['title'], verify_integrity=True), on='movie', how='left')
title_df_join.info()

#### Sadly, the title_id column (62 non-null) will not net us much more reliable data than using the titles to join between top_100_df (61 non-null) and genre_df. 

* So, I think I will clean up the top_100_join dataframe by manually checking and changing the relevant movies.

* In order to cut down on some of the work, I will cut it down to the top 50 grossing movies.

#### trimming wordwide_gross_df to top 50 worldwide gross movies

top_50_gross = convert_worldwide_gross
top_50_gross = top_100_gross.nlargest(50,['worldwide_gross'])
top_50_gross.head()

#### Join top_50_gross to genre_df_join

top_50_gross_join = top_50_gross.join(genre_df_join.set_index(['primary_title'], verify_integrity=True), on='movie', how='left')
top_50_gross_join

#### Find and replace NaN and incorrect genres

missing_genre_50 = pd.isnull(top_50_gross_join['genres'])
missing_genre = top_50_gross_join[missing_genre_50]
missing_genre

missing_genre.at[5,'genres'] == "Action,Adventure,Sci-Fi"
missing_genre

##### 14 movie genres to add - I can do this.

missing_genre_replaced = missing_genre["genres"].replace"Action,Adventure,Sci-Fi", "Adventure,Fantasy,Mystery"]})
missing_genre_replaced


replace_val_top_50 = top_50_gross_join
replace_val_top_50.replace(to_replace=)

I am pausing and coming back to this - now I am going to start making the histogram.

#### Making the Histogram of Genre's for Top 50 Grossing Movies

genre_columns = top_50_gross_join
values = True if 'Adventure' in genre_columns['genres']
        Else:
            return False
genre_columns['Adventure'] = values
genre_columns

top_50_gross_join.info()

fig, ax = plt.hist(top_50_gross_join['genres'])
labels = ax.get_xticklabels()
plt.setp(labels, rotation=45, horizontalalignment='right')

## Data Preparation

Describe and justify the process for preparing the data for analysis.

***
Questions to consider:
* Were there variables you dropped or created?
* How did you address missing values or outliers?
* Why are these choices appropriate given the data and the business problem?
***

# Here you run your code to clean the data

## Data Modeling
Describe and justify the process for analyzing or modeling the data.

***
Questions to consider:
* How did you analyze or model the data?
* How did you iterate on your initial approach to make it better?
* Why are these choices appropriate given the data and the business problem?
***

# Here you run your code to model the data


## Evaluation
Evaluate how well your work solves the stated business problem.

***
Questions to consider:
* How do you interpret the results?
* How well does your model fit your data? How much better is this than your baseline model?
* How confident are you that your results would generalize beyond the data you have?
* How confident are you that this model would benefit the business if put into use?
***

## Conclusions
Provide your conclusions about the work you've done, including any limitations or next steps.

***
Questions to consider:
* What would you recommend the business do as a result of this work?
* What are some reasons why your analysis might not fully solve the business problem?
* What else could you do in the future to improve this project?
***